TITANIC DATASET ANALYSIS

In [ ]:
import pandas as pd
import numpy as np

Read the file

In [ ]:
df=pd.DataFrame(pd.read_csv('/content/Untitled Folder/train (1).csv')) 
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

Number of Rows & Columns

In [ ]:
df.shape

(891, 12)

 NULL VALUES

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
Ticket           0
Fare             0
Cabin          687
Embarked         2
family_size      0
Alone            0
dtype: int64

Separating out the columns which have morethan 35%of the value missing in the dataset.

In [ ]:
drop_col=df.isnull().sum()[df.isnull().sum()>(35/100)*df.shape[0]]
drop_col

Cabin    687
dtype: int64

In [ ]:
drop_col.index

Index(['Cabin'], dtype='object')

Drop column

In [ ]:
df.drop(drop_col.index,axis=1, inplace=True) 
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [ ]:
df.fillna(df.mean(),inplace=True) 
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
Ticket         0
Fare           0
Embarked       0
family_size    0
Alone          0
dtype: int64

Details of column EMBARKED

In [ ]:
df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

For EMBARKED attribute, we fill the null values with the most frequent value in the coloumn.

In [ ]:
df['Embarked'].fillna('S', inplace=True)

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
Ticket           0
Fare             0
Embarked         0
family_size      0
Alone            0
dtype: int64

Correlation Function

In [ ]:
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  family_size
PassengerId     1.000000 -0.005007 -0.035144  0.036847  0.012658    -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.077221  0.257307     0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.369226 -0.549500     0.065997
Age             0.036847 -0.077221 -0.369226  1.000000  0.096067    -0.301914
Fare            0.012658  0.257307 -0.549500  0.096067  1.000000     0.217138
family_size    -0.040143  0.016639  0.065997 -0.301914  0.217138     1.000000

 Make a new column family_size by combining the columns"sibsp and patch".

In [ ]:
df['family_size']=df['SibSp']+df['Parch']
df.drop(['SibSp','Parch'], axis=1, inplace=True) 
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  family_size
PassengerId     1.000000 -0.005007 -0.035144  0.036847  0.012658    -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.077221  0.257307     0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.369226 -0.549500     0.065997
Age             0.036847 -0.077221 -0.369226  1.000000  0.096067    -0.301914
Fare            0.012658  0.257307 -0.549500  0.096067  1.000000     0.217138
family_size    -0.040143  0.016639  0.065997 -0.301914  0.217138     1.000000

Family Size in the ship does not have much correlance with survival rate.

In [ ]:
df['Alone']=[0 if df['family_size'][i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked family_size  Alone
0            1         0       3  ...        S           1      0
1            2         1       1  ...        C           1      0
2            3         1       3  ...        S           0      1
3            4         1       1  ...        S           1      0
4            5         0       3  ...        S           0      1

[5 rows x 11 columns]

In [ ]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

If the person is alone he/she has less chance of surviving.

In [ ]:
df[['Alone', 'Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

So we can see if the person was not alone, the chance of ticket price is higher.

In [ ]:
df['Sex']=[0 if df['Sex'][i]== 'male' else 1 for i in df.index]#1 for female, 0 for male
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

It shows that female passengers have more chance of surviving than male passengers.

It shows women were prioritized over men.

In [ ]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.336957
Name: Survived, dtype: float64

CONCLUSION
 
•Female passengers were prioritized over male passengers. 

•People with high class Or rich people have higher survival rate than others. The Heriarchy might have been followed while saving the passengers. 

•Passengers travelling with their family have higher survival rate. 

•Passengers who borded the ship at Cherbourg, survived more in Porportion than others.